#+TITLE: Gptel Execute Elisp Tools
#+PROPERTY: header-args:emacs-lisp :tangle gptel-execute-elisp-tools.el 

This tool allows LLMs to execute arbitrary elisp code in the currently running Emacs process.

* Tool Definition

#+begin_src emacs-lisp
(gptel-make-tool
 :name        "execute_elisp"
 :include t
 :function    #'my/gptel-execute-elisp
 :description "Execute arbitrary elisp code in the current Emacs process and return the result.
	 Use with extreme caution as this has full access to the Emacs environment."
 :args        '((:name "code"
		 :type string
		 :description "The elisp code to evaluate")
                (:name "purpose"
                 :type string
                 :description "Required explanation of why this elisp code execution is being performed"))
 :category    "development")
#+end_src

#+RESULTS:
: #s(gptel-tool my/gptel-execute-elisp "execute_elisp" "Execute arbitrary elisp code in the current Emacs process and return the result.
: 	 Use with extreme caution as this has full access to the Emacs environment." ((:name "code" :type "string" :description "The elisp code to evaluate") (:name "purpose" :type "string" :description "Required explanation of why this elisp code execution is being performed")) nil "development" nil t)

* Tool Registration

#+begin_src emacs-lisp
(register-gptel-tool "execute_elisp")
#+end_src

#+RESULTS:
| #s(gptel-tool my/gptel-execute-elisp execute_elisp Execute arbitrary elisp code in the current Emacs process and return the result. |
